app/views/customers/index.html.erb

          <% @product_price = 0 %>
          <% customer.products.each do |product|  %>
---
SELECT "products".* FROM "products" INNER JOIN "customer_products" ON "products"."id" = "customer_products"."product_id" WHERE "customer_products"."customer_id" = ?  [["customer_id", 1]]