app/views/analizes/_statistics.html.erb

    <li class="list-group-item">
      <span class="badge"><%= Product.count %></span>
---
SELECT COUNT(*) FROM "products"

    <li class="list-group-item">
      <span class="badge"> <%= Customer.count %></span>
---
SELECT COUNT(*) FROM "customers"

      <% @total_price = 0 %>
      <% @customer.products.each do |product|  %>
---
SELECT "products".* FROM "products" INNER JOIN "customer_products" ON "products"."id" = "customer_products"."product_id" WHERE "customer_products"."customer_id" = ?  [["customer_id", 1]]