app/controllers/analizes_controller.rb

    def set_customerproduct
      @cproducts =  CustomerProduct.all
---
SELECT "customer_products".* FROM "customer_products" GROUP BY "customer_products"."customer_id"