app/controllers/customers_controller.rb

INSERT INTO "customer_products" ("product_id", "customer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["customer_id", 1], ["created_at", "2015-09-13 15:52:48.936605"], ["updated_at", "2015-09-13 15:52:48.936605"]]
INSERT INTO "customers" ("name", "number", "website", "business", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "sucuk"], ["number", "454879"], ["website", "sucuk.com"], ["business", "et"], ["created_at", "2015-09-17 22:19:27.005450"], ["updated_at", "2015-09-17 22:19:27.005450"]]
---
  def create
    @customer = Customer.new(customer_params)
    params[:customer][:product_ids].each do |product_id|
      CustomerProduct.create(customer_id: @customer.id, product_id: product_id.to_i)

SELECT "products".* FROM "products"
---
    def set_product
      @products = Product.all