app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "properties", "price", "link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "dsafdf"], ["properties", "dsafsdf"], ["price", 12321.0], ["link", "asdfadsf"], ["created_at", "2015-09-13 08:49:32.496093"], ["updated_at", "2015-09-13 08:49:32.496093"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 200.0], ["updated_at", "2015-09-17 22:12:08.144044"], ["id", 1]]